---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithFold
source: html/aba17d03-ce1a-6338-c648-69224d83ca38.htm
---
# StructuralSectionSigmaProfileWithFold Members

Creates a new instance of Structural Section Sigma Profile With Fold shape with the associated set of parameters,
 used to attach to structural element.